In [109]:
import pandas as pd

In [110]:
path = r'C:\Users\pestyl\Desktop\github repos\Data-Projects\Tutorials\Python Tutorials\Pandas'

#### Change working directory (if necessary)

In [111]:
import os

In [112]:
os.getcwd()

'C:\\Users\\pestyl\\Desktop\\github repos\\Data-Projects\\Tutorials\\Python Tutorials\\Pandas'

In [113]:
os.chdir(path)

In [114]:
os.getcwd()

'C:\\Users\\pestyl\\Desktop\\github repos\\Data-Projects\\Tutorials\\Python Tutorials\\Pandas'

## Read and Write CSV Files

#### Read CSV Files

In [115]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [116]:
df = pd.read_csv('example.csv')

In [117]:
df.head()

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### Export to CSV

#### Without index=False the index is output as an unnamed column

In [118]:
df.to_csv('output.csv')

In [119]:
pd.read_csv('output.csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [120]:
df.to_csv('output.csv',index=False)

In [121]:
pd.read_csv('output.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## Read and Write Excel Files

#### Read excel file

In [122]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [123]:
df = pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

#### Write to excel

In [124]:
df.to_excel('ExcelOutput.xlsx',sheet_name='Test')

## Working with HTML

#### Use: https://www.fdic.gov/bank/individual/failed/banklist.html

In [125]:
website='https://www.fdic.gov/bank/individual/failed/banklist.html'

In [126]:
data = pd.read_html(website)

In [127]:
type(data)

list

In [128]:
df = data[0]

In [129]:
df.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","November 7, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","November 12, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","November 7, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"

In [99]:
df["Bank Name"].nunique()

543

In [101]:
df.shape

(559, 7)

In [103]:
vc = df["Bank Name"].value_counts()

In [107]:
vc[vc>2]

First State Bank    3
Horizon Bank        3
Premier Bank        3
Name: Bank Name, dtype: int64

In [108]:
vc[vc>2].index

Index(['First State Bank', 'Horizon Bank', 'Premier Bank'], dtype='object')

In [130]:
df.loc[df.ST == 'NC']

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
56,Pisgah Community Bank,Asheville,NC,58701,"Capital Bank, N.A.","May 10, 2013","August 8, 2016"
58,Parkway Bank,Lenoir,NC,57158,"CertusBank, National Association","April 26, 2013","October 6, 2017"
90,Waccamaw Bank,Whiteville,NC,34515,First Community Bank,"June 8, 2012","January 29, 2019"
132,"Blue Ridge Savings Bank, Inc.",Asheville,NC,32347,Bank of North Carolina,"October 14, 2011","October 11, 2018"
204,The Bank of Asheville,Asheville,NC,34516,First Bank,"January 21, 2011","January 29, 2019"
468,Cooperative Bank,Wilmington,NC,27837,First Bank,"June 19, 2009","March 12, 2018"
485,Cape Fear Bank,Wilmington,NC,34639,First Federal Savings and Loan Association,"April 10, 2009","April 10, 2017"